app/controllers/posts_controller.rb

SELECT "tags".* FROM "tags"
---
  def new
    @post = Post.new
    @tags = Tag.all

INSERT INTO "posts" ("name", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Post title"], ["content", "post content"], ["created_at", "2015-07-07 03:42:51.508468"], ["updated_at", "2015-07-07 03:42:51.508468"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save